#+TITLE:  Study
#+AUTHOR: Marco Ciccalè Baztán

#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2026-03-19 Thu 22:06]
| Headline                                    | Time   |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *1:18* |      |
|---------------------------------------------+--------+------|
| Books                                       | 1:18   |      |
| \_  How to Prove It: An Structured Approach |        | 1:18 |
#+END:

* Books
** How to Prove It: An Structured Approach
:LOGBOOK:
CLOCK: [2026-03-19 Thu 20:50]--[2026-03-19 Thu 21:30] =>  0:40
CLOCK: [2026-03-19 Thu 20:02]--[2026-03-19 Thu 20:40] =>  0:38
:END:
*** [2026-03-19 Thu]
- Read the intro on math and proofs (with prime numbers as the driving example).
- Solved exercises 1a, 1b, and barely tried exercise 7.
- Read section 1.1: "Deductive reasoning and logical connectives".
